app/controllers/portfolios_controller.rb

  def index
    @portfolios = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

  def show
    total_value = 0
    @portfolio.coins.each do |coin|
      coin.fetchCoinUpdatePriceData
      coin.totalReturnsCalculation
      total_value = total_value + coin.total_value
    end
    @portfolio.total_value = total_value
    @portfolio.totalReturnsCalculation
    @portfolio.save
---
SELECT "coins".* FROM "coins" WHERE "coins"."portfolio_id" = ?  [["portfolio_id", 1]]
UPDATE "coins" SET "symbol" = ?, "name" = ?, "image" = ?, "current_price" = ?, "market_cap" = ?, "market_cap_rank" = ?, "total_volume" = ?, "high_24h" = ?, "low_24h" = ?, "price_change_24h" = ?, "price_change_percentage_24h" = ?, "market_cap_change_24h" = ?, "market_cap_change_percentage_24h" = ?, "circulating_supply" = ?, "total_supply" = ?, "price_change_percentage_1h_in_currency" = ?, "updated_at" = ? WHERE "coins"."id" = ?
UPDATE "portfolios" SET "total_value" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["total_value", 3311256.6], ["updated_at", "2021-06-28 21:41:49.754071"], ["id", 1]]

    def set_portfolio
      @portfolio = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]