app/controllers/trades_controller.rb

SELECT "trades".* FROM "trades"
---
  def index
    @trades = Trade.all