app/models/coin.rb

UPDATE "coins" SET "symbol" = ?, "name" = ?, "image" = ?, "current_price" = ?, "market_cap" = ?, "market_cap_rank" = ?, "total_volume" = ?, "high_24h" = ?, "low_24h" = ?, "price_change_24h" = ?, "price_change_percentage_24h" = ?, "market_cap_change_24h" = ?, "market_cap_change_percentage_24h" = ?, "circulating_supply" = ?, "total_supply" = ?, "price_change_percentage_1h_in_currency" = ?, "updated_at" = ? WHERE "coins"."id" = ?
---
    def fetchCoinUpdatePriceData
        require 'net/http'
        coin_id = self.coin_id
        url = url = "https://api.coingecko.com/api/v3/coins/markets?vs_currency=usd&ids=#{coin_id}&order=market_cap_desc&per_page=100&page=1&sparkline=false&price_change_percentage=1h"
        request = URI.parse(url)
        response = Net::HTTP.get_response(request)
        crypto_hash = JSON.parse(response.body)
        # Updating Values
        self.symbol = crypto_hash[0]['symbol']
        self.name = crypto_hash[0]['name']
        self.image = crypto_hash[0]['image']
        self.current_price = crypto_hash[0]['current_price']
        self.market_cap = crypto_hash[0]['market_cap']
        self.market_cap_rank = crypto_hash[0]['market_cap_rank']
        self.total_volume = crypto_hash[0]['total_volume']
        self.high_24h = crypto_hash[0]['high_24h']
        self.low_24h = crypto_hash[0]['low_24h']
        self.price_change_24h = crypto_hash[0]['price_change_24h']
        self.price_change_percentage_24h = crypto_hash[0]['price_change_percentage_24h']
        self.market_cap_change_24h = crypto_hash[0]['market_cap_change_24h']
        self.market_cap_change_percentage_24h = crypto_hash[0]['market_cap_change_percentage_24h']
        self.circulating_supply = crypto_hash[0]['circulating_supply']
        self.total_supply = crypto_hash[0]['total_supply']
        self.price_change_percentage_1h_in_currency = crypto_hash[0]['price_change_percentage_1h_in_currency']
        self.save

UPDATE "coins" SET "total_value" = ?, "total_return" = ?, "total_return_percentage" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["total_value", 3119310.0], ["total_return", 3037500.0], ["total_return_percentage", 3712.871287128713], ["updated_at", "2021-06-28 21:37:49.740386"], ["id", 1]]
---
    def totalReturnsCalculation
        self.total_value = self.quantity * self.current_price
        self.total_return = (self.quantity * self.current_price) - (self.quantity * self.average_cost)
        self.total_return_percentage = ((self.current_price - self.average_cost)/self.average_cost) * 100
        self.save