app/models/portfolio.rb

    def totalReturnsCalculation
        # self.total_value = self.quantity * self.current_price
        self.total_return = self.total_value - self.initial_balance
        self.total_return_percentage = ((self.total_value - self.initial_balance)/self.initial_balance) * 100
        self.save
---
UPDATE "portfolios" SET "total_value" = ?, "total_return" = ?, "total_return_percentage" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["total_value", 3313002.6], ["total_return", 3303002.6], ["total_return_percentage", 33030.026], ["updated_at", "2021-06-28 21:44:43.411424"], ["id", 1]]